interface Locations {
  name: string;
  lat: number;
  lon: number;
}

export const LOCATIONS: Locations[] = [
  { name: "강릉시", lat: 37.74913611, lon: 128.8784972 },
  { name: "광주시", lat: 35.1812138, lon: 126.9010806 },
  { name: "대구시", lat: 35.86952722, lon: 128.6061745 },
  { name: "대전시", lat: 36.32582989, lon: 127.421381 },
  { name: "목포시", lat: 34.80878889, lon: 126.3944194 },
  { name: "부산시", lat: 35.10321667, lon: 129.0345083 },
  { name: "서울시", lat: 37.56100278, lon: 126.9996417 },
  { name: "수원시", lat: 37.30101111, lon: 127.0122222 },
  { name: "안동시", lat: 36.56546389, lon: 128.7316222 },
  { name: "여수시", lat: 34.75731111, lon: 127.6643861 },
  { name: "울산시", lat: 35.546, lon: 129.3123 },
  { name: "인천시", lat: 37.47384843, lon: 126.6217617 },
  { name: "전주시", lat: 35.80918889, lon: 127.1219194 },
  { name: "제주시", lat: 33.49631111, lon: 126.5332083 },
  { name: "청주시", lat: 36.58399722, lon: 127.5117306 },
  { name: "춘천시", lat: 37.87854167, lon: 127.7323111 },
  { name: "포항시", lat: 36.00568611, lon: 129.3616667 },
];
